test/testData/dummy_order_collection_filters.json

{
    "total_count": 70,
    "object": "list",
    "data": [
        {
            "status": "created",
            "created_at": 1495886585,
            "object": "order",
            "id": "order_v8L1DG0Y5kmgC7tI",
            "currency": "INR",
            "amount": 1000,
            "payment_attempts": 0,
            "merchant_order_id": "M125",
            "notes": {}
        },
        {
            "status": "paid",
            "created_at": 1495883576,
            "object": "order",
            "id": "order_HAj8PcIH5NSCay4Z",
            "currency": "INR",
            "amount": 600,
            "payment_attempts": 1,
            "merchant_order_id": "M126",
            "notes": {}
        },
        {
            "status": "payment_attempted",
            "created_at": 1495883487,
            "object": "order",
            "id": "order_52P2DiQuSJCve0Nx",
            "currency": "INR",
            "amount": 100,
            "payment_attempts": 1,
            "merchant_order_id": "M128",
            "notes": {}
        }
    ]
}
